/**
 * Three pages of DigitalKhatt's IndoPak file, byte for byte as published
 * (MIT, © 2020–present DigitalKhatt contributors): pages 1 and 2, the
 * framed plates with al-Fātiḥah's unnumbered basmalah and its printed 6
 * and 7, and page 610, the ten-line last page. In the file's own shape,
 * trailing comma included, so the parser is tested on the real thing.
 */
export const INDOPAK_FIXTURE =
  `let quranText = [
[
    'سُورَةُ الفَاتِحَةِ',
    'بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ ۝',
    'اَلْحَمْدُ لِلّٰهِ رَبِّ الْعٰلَمِيْنَ ۝١ۙ الرَّحْمٰنِ',
    'الرَّحِيْمِ ۝٢ۙ مٰلِكِ يَوْمِ الدِّيْنِ ۝٣ؕ',
    'اِيَّاكَ نَعْبُدُ وَاِيَّاكَ نَسْتَعِيْنُ ۝٤ؕ',
    'اِهْدِنَا الصِّرَاطَ الْمُسْتَقِيْمَ ۝٥ۙ صِرَاطَ',
    'الَّذِيْنَ اَنْعَمْتَ عَلَيْهِمْ‮٦࣢ۙ غَيْرِ',
    'الْمَغْضُوْبِ عَلَيْهِمْ وَلَا الضَّا࢜لِّيْنَ ۝٧ࣖ',
  ],
[
    'سُورَةُ البَقَرَةِ',
    'بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ ۝',
    'ال࢜مّ࢜ ۝١ۚ ذٰلِكَ الْكِتٰبُ لَا رَيْبَۚۖۛ فِيْهِۚۛ',
    'هُدًي لِّلْمُتَّقِيْنَ ۝٢ۙ الَّذِيْنَ يُو͏ٔ͏ْمِنُوْنَ',
    'بِالْغَيْبِ وَيُقِيْمُوْنَ الصَّلٰوةَ وَمِمَّا',
    'رَزَقْنٰهُمْ يُنْفِقُوْنَ ۝٣ۙ وَالَّذِيْنَ يُو͏ٔ͏ْمِنُوْنَ',
    'بِمَا͏ٓ اُنْزِلَ اِلَيْكَ وَمَا͏ٓ اُنْزِلَ مِنْ',
    'قَبْلِكَۚ وَبِالْاٰخِرَةِ هُمْ يُوْقِنُوْنَ ۝٤ؕ',
  ],
[
    'سُورَةُ الفَلَقِ',
    'بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ ۝',
    'قُلْ اَعُوْذُ بِرَبِّ الْفَلَقِ ۝١ۙ مِنْ شَرِّ مَا خَلَقَ ۝٢ۙ وَمِنْ',
    'شَرِّ غَاسِقٍ اِذَا وَقَبَ ۝٣ۙ وَمِنْ شَرِّ النَّفّٰثٰتِ فِي الْعُقَدِ ۝٤ۙ',
    'وَمِنْ شَرِّ حَاسِدٍ اِذَا حَسَدَ ۝٥ࣖ',
    'سُورَةُ النَّاسِ',
    'بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ ۝',
    'قُلْ اَعُوْذُ بِرَبِّ النَّاسِ ۝١ۙ مَلِكِ النَّاسِ ۝٢ۙ اِلٰهِ النَّاسِ ۝٣ۙ',
    'مِنْ شَرِّ الْوَسْوَاسِ࣢ۙ الْخَنَّاسِ ۝٤ࣕۙ الَّذِيْ يُوَسْوِسُ فِيْ',
    'صُدُوْرِ النَّاسِ ۝٥ۙ مِنَ الْجِنَّةِ وَالنَّاسِ ۝٦ࣖ',
  ],
];
export { quranText };
`;
